#!/usr/bin/env python3

import socket



# სერვერის მისამართი
HOST = '0.0.0.0'
# სერვერის პორტი
PORT = 5000


# სოკეტის ობიექტის შექმნა
s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

# სერვერისგან განსხვავებით კლიენტი იყენებს connect ფუნქციას სერვერთან დასაკავშირებლათ
s.connect((HOST, PORT))

to_send = 'Hi, i am client N01'

# სერვერისთვის ინფორმაციის გაგზავნა.
# როგორც სერვერის შემთხვევაში, ამ შემთხვევაშიც აუცილებელია სტრინგის კოდირება (ბაიტკოდად გარდაქმნა)
s.send(to_send.encode('utf-8'))

# ინფორმაციის მიღება
# პარამეტრი 1024 გასაზღვრავს ბუფერის სიდიდეს ბაიტებში.
# მოცემულ შემთხვევაში ერთ ჯერზე მაქსიმუმ 1024 ბაიტის მიღება იქნება შესაძლებელი. 
msg = s.recv(1024).decode('utf-8')

# ინფორმაციის მიღების შედგომ პორტის დახურვა
s.close()


print('Data received from server: ', msg)
